# Load a scores table and compile tables to get top words in summary table

In [1]:
%load_ext lab_black

In [2]:
from pathlib import Path
import pandas as pd

### Load a score tables (ex : 7 letters starting with A)

In [3]:
df = pd.read_csv("./scores/scores_7_A.csv", header=None)
df.head()

         0          1
0  ABLATAS  75.299917
1  ALDOSES  81.599834
2  ANCRIEZ  52.674399
3  AUBIERS  45.900580
4  ANOMIES  39.144159

In [4]:
scores = dict(df.values)
# top 10 to start with
sorted(scores.items(), key=lambda x: x[1])[:10]

[('ALAIRES', 22.56917978458989),
 ('ARAINES', 23.34382767191384),
 ('ANIERES', 23.95774647887324),
 ('ANURIES', 24.183098591549296),
 ('AIRATES', 25.383595691797847),
 ('ASTERIE', 25.728251864125934),
 ('ARTISAN', 26.06462303231152),
 ('ATRESIE', 26.594863297431647),
 ('ARSENIE', 26.75807787903894),
 ('ANERIES', 26.80447390223695)]

### Compile all tables

In [6]:
p = Path(".")
top_scores_list = []
for file in p.glob("scores/*.csv"):
    print(Path(file))
    df = pd.read_csv(Path(file), header=None)
    top_scores_list.append(
        {
            "nb_letters": Path(file).stem[7],
            "first_letter": Path(file).stem[9],
            "top_word": df.loc[df[1].idxmin()][0],
            "score": df.loc[df[1].idxmin()][1],
        }
    )

scores\scores_7_A.csv
scores\scores_7_S.csv

In [45]:
compil = pd.DataFrame(top_scores_list)
compil.to_csv("top_words.csv", index=False)

  nb_letters first_letter top_word      score
0          7            A  ALAIRES  22.569180
1          7            S  SAURIES  14.187755

### Load and visualize compilation table (top words)

In [49]:
tops = pd.read_csv(
    "top_words.csv",
)
tops.head()

   nb_letters first_letter top_word      score
0           7            A  ALAIRES  22.569180
1           7            S  SAURIES  14.187755